app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def find_company
    @company = Company.find(params[:id])