app/controllers/resumes_controller.rb

  def create
    @new_resume = Resume.new(allowed_parameters)
    @new_resume = current_user.resumes.build(allowed_parameters)
    if @new_resume.save
---
INSERT INTO "resumes" ("created_at", "updated_at", "resume_name", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-03-27 07:07:58.057197"], ["updated_at", "2020-03-27 07:07:58.057197"], ["resume_name", "1st resume"], ["user_id", 3]]

  def update
    if @resume.update(allowed_parameters)
---
UPDATE "resumes" SET "resume_name" = $1, "updated_at" = $2 WHERE "resumes"."id" = $3  [["resume_name", "2nd resume"], ["updated_at", "2020-03-27 07:10:32.851885"], ["id", 8]]

  def destroy
    if @resume.destroy
---
DELETE FROM "resumes" WHERE "resumes"."id" = $1  [["id", 15]]

  def find_resume
    @resume = current_user.resumes.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."user_id" = $1 AND "resumes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 15], ["LIMIT", 1]]