app/controllers/technologies_controller.rb

  def index
    @all_technologies = Technology.all
---
SELECT "technologies".* FROM "technologies"

  def create
    @new_technology = Technology.new(allowed_parameter)
    if @new_technology.save
---
INSERT INTO "technologies" ("technology_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["technology_name", "c++"], ["created_at", "2020-03-27 10:43:51.338523"], ["updated_at", "2020-03-27 10:43:51.338523"]]

  def destroy
    flash.alert = if @added_technology.destroy
---
DELETE FROM "technologies" WHERE "technologies"."id" = $1  [["id", 9]]

  def find_technology
    @added_technology = Technology.find(params[:id])
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]