app/controllers/user_resumes_controller.rb

INSERT INTO "user_resumes" ("created_at", "updated_at", "user_id", "resume_name", "resume") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-03-26 17:19:09.921588"], ["updated_at", "2020-03-26 17:19:09.921588"], ["user_id", 3], ["resume_name", "2nd resume"], ["resume", "bill.txt"]]
---
  def create
    @new_resume = UserResume.new(allowed_parameters)
    @new_resume.user_id = current_user.id
    flash.alert = if @new_resume.save

UPDATE "user_resumes" SET "resume_name" = $1, "resume" = $2, "updated_at" = $3 WHERE "user_resumes"."id" = $4  [["resume_name", "2nd resume"], ["resume", "bill.txt"], ["updated_at", "2020-03-26 17:45:24.648776"], ["id", 5]]
---
  def update
    flash.alert = if @resume.update(allowed_parameters)

DELETE FROM "user_resumes" WHERE "user_resumes"."id" = $1  [["id", 2]]
---
  def destroy
    flash.alert = if @resume.destroy

SELECT "user_resumes".* FROM "user_resumes" WHERE "user_resumes"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
  def show_all_resumes
    @resumes = UserResume.where(user_id: current_user.id)

SELECT "user_resumes".* FROM "user_resumes" WHERE "user_resumes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_resume
    @resume = UserResume.find(params[:id])